==================
arg command
==================

ARG foo

---

    (source_file
      base_target: (block
        (arg_command
          name: (variable))))


==================
arg command required
==================

ARG --required foo

---

    (source_file
      base_target: (block
        (arg_command
          options: (options
            (required))
          name: (variable))))


==================
arg command global
==================

ARG --global foo

---

    (source_file
      base_target: (block
        (arg_command
          options: (options
            (global))
          name: (variable))))


==================
arg command default value
==================

ARG foo=aaa

---

    (source_file
      base_target: (block
        (arg_command
          name: (variable)
          default_value: (string
            (unquoted_string)))))


==================
arg command default value single quoted
==================

ARG foo='auie tsrn'

---

    (source_file
      base_target: (block
        (arg_command
          name: (variable)
          default_value: (string
            (single_quoted_string)))))


==================
arg command default value double quoted
==================

ARG foo="it's

ok"

---

    (source_file
      base_target: (block
        (arg_command
          name: (variable)
          default_value: (string
            (double_quoted_string)))))


==================
arg command default value expr
==================

ARG foo=$(echo $(echo hop))

---

    (source_file
      base_target: (block
        (arg_command
          name: (variable)
          default_value: (string
            (unquoted_string
              (expansion
                (shell_fragment)))))))


==================
arg command without values
==================

ARG foo=

---

    (source_file
      base_target: (block
        (arg_command
          name: (variable))))


==================
arg command with spaces around =
==================

ARG foo = bar

---

    (source_file
      base_target: (block
        (arg_command
          name: (variable)
          default_value: (string
            (unquoted_string)))))


==================
arg command with value starting with a sharp
==================

ARG foo="#123456"

---

    (source_file
      base_target: (block
        (arg_command
          name: (variable)
          default_value: (string
            (double_quoted_string)))))


==================
arg command unquoted with spaces
==================

ARG foo=a bb  ccc   dddd    # comment

---

    (source_file
      base_target: (block
        (arg_command
          name: (variable)
          default_value: (string
            (unquoted_string))
          (comment))))


==================
arg command default value with line continuations
==================

ARG foo="a \
b \
c \
d"

---

    (source_file
      base_target: (block
        (arg_command
          name: (variable)
          default_value: (string
            (double_quoted_string)))))




==================
arg command default value with line continuations
==================

ARG foo='a \
b \
c \
d'

---

    (source_file
      base_target: (block
        (arg_command
          name: (variable)
          default_value: (string
            (single_quoted_string)))))
