==================
env command
==================
foo:
  ENV foo=bar

---

    (source_file
      (target
        name: (identifier)
        (block
          (env_command
            key: (variable)
            value: (string
              (unquoted_string))))))


==================
env command with spaces around =
==================
foo:
  ENV foo = bar

---

    (source_file
      (target
        name: (identifier)
        (block
          (env_command
            key: (variable)
            value: (string
              (unquoted_string))))))


==================
env command without =
==================
foo:
  ENV foo bar

---

    (source_file
      (target
        name: (identifier)
        (block
          (env_command
            key: (variable)
            value: (string
              (unquoted_string))))))


==================
env command with comment
==================
ENV BUILDKIT_DEBUG_GIT=1 # a comment

---

    (source_file
      base_target: (block
        (env_command
          key: (variable)
          value: (string
            (unquoted_string))
          (comment))))
