==================
target
==================
foo:

---

(source_file
  (target
    name: (identifier)))


==================
target with comment
==================
foo: # the foo target

---

(source_file
  (target
    name: (identifier)
    (comment)))


==================
target with command
==================
foo:
    ARG bar

---

    (source_file
      (target
        name: (identifier)
        (block
          (arg_command
            name: (variable)))))


==================
target with comments
==================
# a comment
    # a comment
foo:
    # another comment
    ARG bar
# a comment
    ARG foo # comment
    # comment

---
    (source_file
      base_target: (block
        (comment)
        (comment))
      (target
        name: (identifier)
        (block
          (comment)
          (arg_command
            name: (variable))
          (comment)
          (arg_command
            name: (variable)
            (comment))
          (comment))))
